# <font face = 'Impact' color = '#FFAEBC' > Exercise on Loading, Organizing, and Storing Data<font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Licence: GPL v3.0 <font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Author and Trainer: Paolo Hilado MSc. (Data Science) <font/>
Showcase your learning and skills by accomplishing this jupyter notebook. Follow through each of the tasks and code with python to address them.

# Name of Participant: Mark Joseph J. Solidarios

In [10]:
# Import the necessary libraries such as pandas, researchpy, os, and numpy.
import pandas as pd
import numpy as np
import researchpy as rp
import os
import qdesc as qd

In [7]:
#Checking out the current working directory
print(os.getcwd())

/home/user/Desktop/practice/Day1

In [8]:
#Load a spreadsheet and assigning it to a variable df.
# Open and work on "ExperimentOne.xlsx".
df = pd.read_excel("ExperimentOne.xlsx")

In [9]:
#View the dataframe
df

    ID   Post  Group
0    1  17.23  Cntrl
1    2  16.04  Cntrl
2    3  19.22  Cntrl
3    4  19.45  Cntrl
4    5  18.53  Cntrl
..  ..    ...    ...
69  70   6.86     Tx
70  71  17.63     Tx
71  72  18.84     Tx
72  73  15.11     Tx
73  74  19.07     Tx

[74 rows x 3 columns]

In [10]:
# Viewing the first 7 rows
df.head(7)

   ID   Post  Group
0   1  17.23  Cntrl
1   2  16.04  Cntrl
2   3  19.22  Cntrl
3   4  19.45  Cntrl
4   5  18.53  Cntrl
5   6  21.00  Cntrl
6   7  19.28  Cntrl

In [11]:
# Viewing the last 7 rows
df.tail(7)

    ID   Post Group
67  68  12.55    Tx
68  69  19.67    Tx
69  70   6.86    Tx
70  71  17.63    Tx
71  72  18.84    Tx
72  73  15.11    Tx
73  74  19.07    Tx

In [17]:
# Slice the data frame to only show the data on the "Post" Column.
# Slicing column approach 1
df["Post"]
# Slicing a column approach 2
df.Post

0     17.23
1     16.04
2     19.22
3     19.45
4     18.53
      ...
69     6.86
70    17.63
71    18.84
72    15.11
73    19.07
Name: Post, Length: 74, dtype: float64

In [19]:
# Create different subsets of the data frame and show it.
# Get the data for the first column
subset = df.iloc[:,0]
subset

0      1
1      2
2      3
3      4
4      5
      ..
69    70
70    71
71    72
72    73
73    74
Name: ID, Length: 74, dtype: int64

In [18]:
# Get the Post Test and Group data for records 1-10 
df.iloc[1:11, [1, 2]]

     Post  Group
1   16.04  Cntrl
2   19.22  Cntrl
3   19.45  Cntrl
4   18.53  Cntrl
5   21.00  Cntrl
6   19.28  Cntrl
7   19.63  Cntrl
8   12.66  Cntrl
9   17.55  Cntrl
10  18.08  Cntrl

In [19]:
# Get the Post Test and Group data for records 7,11,15,50,61.
nsub = df.iloc[[7,11,15,50,61], [1, 2]]
nsub

     Post  Group
7   19.63  Cntrl
11  16.55  Cntrl
15  21.04  Cntrl
50  18.58     Tx
61  16.41     Tx

In [23]:
# Check the information of the data frame such as number of records and features,
# data types of each feature and file size.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      74 non-null     int64
 1   Post    74 non-null     float64
 2   Group   74 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 1.9+ KB

In [25]:
#Checking for NAs or missing cases for the data set
df.isnull().values.any()

np.False_

In [26]:
# Check for NAs per column
df.isnull().any()

ID       False
Post     False
Group    False
dtype: bool

In [30]:
# Provide a descriptive analysis for the Post Test measure
ndesc = df["Post"].describe()
ndesc

count    74.000000
mean     16.924324
std       3.344020
min       5.280000
25%      16.055000
50%      18.205000
75%      19.160000
max      21.040000
Name: Post, dtype: float64

In [22]:
# Provide a descriptive analysis for Post Test measure per Group.
# Make sure that it is rounded to two decimal places only.
# Save this in the variable labeled results.
# Present the results variable
results = np.round(df["Post"].groupby(df["Group"]).describe(),2)
results

       count   mean   std   min    25%    50%    75%    max
Group
Cntrl   37.0  17.23  3.52  5.28  16.24  19.05  19.42  21.04
Tx      37.0  16.62  3.17  6.86  16.01  17.63  18.55  20.83

In [17]:
qd.desc(df)

      count   mean    std  median    MAD   min    max  AD_stat  5% crit_value
ID     74.0  37.50  21.51    37.5  18.50  1.00  74.00     0.80           0.75
Post   74.0  16.92   3.34    18.2   1.35  5.28  21.04     3.82           0.75